alvroblaw/seedsigner-lvgl/embedded/esp32p4/main/main.c
#include <stdio.h>

#include "esp_err.h"
#include "esp_log.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "lvgl.h"

#include "bsp/esp32_p4_wifi6_touch_lcd_4b.h"
#include "bsp/display.h"

static const char *TAG = "sslvgl_p4";

static void create_bringup_screen(void) {
    ESP_LOGI(TAG, "Creating bring-up screen");

    lv_obj_t *screen = lv_scr_act();
    lv_obj_clean(screen);
    lv_obj_set_style_bg_color(screen, lv_color_hex(0x000000), 0);
    lv_obj_set_style_bg_opa(screen, LV_OPA_COVER, 0);

    lv_obj_t *title = lv_label_create(screen);
    lv_label_set_text(title, "seedsigner-lvgl");
    lv_obj_set_style_text_color(title, lv_color_hex(0xFCFCFC), 0);
    lv_obj_set_style_text_font(title, LV_FONT_DEFAULT, 0);
    lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 28);

    lv_obj_t *subtitle = lv_label_create(screen);
    lv_label_set_text(subtitle, "ESP32-P4 Waveshare 4B bring-up");
    lv_obj_set_style_text_color(subtitle, lv_color_hex(0xB8B8B8), 0);
    lv_obj_set_style_text_font(subtitle, LV_FONT_DEFAULT, 0);
    lv_obj_align_to(subtitle, title, LV_ALIGN_OUT_BOTTOM_MID, 0, 12);

    lv_obj_t *card = lv_obj_create(screen);
    lv_obj_remove_style_all(card);
    lv_obj_set_size(card, 620, 220);
    lv_obj_set_style_bg_color(card, lv_color_hex(0x1A1A1A), 0);
    lv_obj_set_style_bg_opa(card, LV_OPA_COVER, 0);
    lv_obj_set_style_border_color(card, lv_color_hex(0x2A2A2A), 0);
    lv_obj_set_style_border_width(card, 2, 0);
    lv_obj_set_style_radius(card, 18, 0);
    lv_obj_align(card, LV_ALIGN_CENTER, 0, 24);

    lv_obj_t *body = lv_label_create(card);
    lv_label_set_text(body,
                      "Display: online\n"
                      "Touch: BSP-managed\n"
                      "Backlight: enabled\n"
                      "Next: integrate seedsigner runtime platform layer");
    lv_obj_set_style_text_color(body, lv_color_hex(0xFCFCFC), 0);
    lv_obj_set_style_text_font(body, LV_FONT_DEFAULT, 0);
    lv_obj_align(body, LV_ALIGN_TOP_LEFT, 24, 24);

    lv_obj_t *footer = lv_label_create(screen);
    lv_label_set_text(footer, "If this screen renders, panel + LVGL path works.");
    lv_obj_set_style_text_color(footer, lv_color_hex(0xFF9F0A), 0);
    lv_obj_set_style_text_font(footer, LV_FONT_DEFAULT, 0);
    lv_obj_align(footer, LV_ALIGN_BOTTOM_MID, 0, -24);
}

void app_main(void) {
    ESP_LOGI(TAG, "Starting ESP32-P4 Waveshare 4B bring-up demo");

    bsp_display_cfg_t cfg = {
        .lvgl_port_cfg = ESP_LVGL_PORT_INIT_CONFIG(),
        .buffer_size = BSP_LCD_H_RES * 40,
        .double_buffer = false,
        .flags = {
            .buff_dma = true,
            .buff_spiram = true,
            .sw_rotate = true,
        },
    };

    lv_display_t *disp = bsp_display_start_with_config(&cfg);
    ESP_LOGI(TAG, "Display start returned: %p", disp);
    assert(disp != NULL);

    /*
     * The BSP re-initializes backlight control during display bring-up.
     * Turning the backlight on before bsp_display_start_with_config() causes
     * a brief visible flash followed by black, because later brightness_init()
     * resets the PWM/GPIO state. So enable brightness only after display init.
     */
    bsp_display_backlight_on();
    bsp_display_brightness_set(100);
    ESP_LOGI(TAG, "Backlight configured after display init");

    bool locked = bsp_display_lock(1000);
    ESP_LOGI(TAG, "Display lock: %s", locked ? "ok" : "failed");
    if (!locked) {
        while (true) {
            vTaskDelay(pdMS_TO_TICKS(1000));
            ESP_LOGE(TAG, "Unable to obtain LVGL lock");
        }
    }

    create_bringup_screen();
    lv_obj_invalidate(lv_scr_act());
    lv_refr_now(NULL);
    ESP_LOGI(TAG, "Bring-up screen rendered");
    bsp_display_unlock();
    ESP_LOGI(TAG, "Display unlocked");

    while (true) {
        vTaskDelay(pdMS_TO_TICKS(1000));
        ESP_LOGI(TAG, "bring-up alive");
    }
}
